{"modelTopology":{"class_name":"Model","config":{"name":"model4","layers":[{"name":"input15","class_name":"InputLayer","config":{"batch_input_shape":[null,264],"dtype":"float32","sparse":false,"name":"input15"},"inbound_nodes":[]},{"name":"input16","class_name":"InputLayer","config":{"batch_input_shape":[null,343],"dtype":"float32","sparse":false,"name":"input16"},"inbound_nodes":[]},{"name":"input17","class_name":"InputLayer","config":{"batch_input_shape":[null,271],"dtype":"float32","sparse":false,"name":"input17"},"inbound_nodes":[]},{"name":"input18","class_name":"InputLayer","config":{"batch_input_shape":[null,153],"dtype":"float32","sparse":false,"name":"input18"},"inbound_nodes":[]},{"name":"input19","class_name":"InputLayer","config":{"batch_input_shape":[null,289],"dtype":"float32","sparse":false,"name":"input19"},"inbound_nodes":[]},{"name":"input20","class_name":"InputLayer","config":{"batch_input_shape":[null,275],"dtype":"float32","sparse":false,"name":"input20"},"inbound_nodes":[]},{"name":"input21","class_name":"InputLayer","config":{"batch_input_shape":[null,142],"dtype":"float32","sparse":false,"name":"input21"},"inbound_nodes":[]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["input15",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["input16",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["input17",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["input18",0,0,{}]]]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["input19",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["input20",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["input21",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense10",0,0,{}],["dense_Dense11",0,0,{}],["dense_Dense12",0,0,{}],["dense_Dense13",0,0,{}],["dense_Dense14",0,0,{}],["dense_Dense1",0,0,{}],["dense_Dense5",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input15",0,0],["input16",0,0],["input17",0,0],["input18",0,0],["input19",0,0],["input20",0,0],["input21",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense10/kernel","shape":[264,1000],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[343,1000],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[271,1000],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[153,1000],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[289,1000],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[275,1000],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[142,1000],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[7000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}