{"modelTopology":{"class_name":"Model","config":{"name":"model6","layers":[{"name":"input29","class_name":"InputLayer","config":{"batch_input_shape":[null,167],"dtype":"float32","sparse":false,"name":"input29"},"inbound_nodes":[]},{"name":"input30","class_name":"InputLayer","config":{"batch_input_shape":[null,185],"dtype":"float32","sparse":false,"name":"input30"},"inbound_nodes":[]},{"name":"input31","class_name":"InputLayer","config":{"batch_input_shape":[null,185],"dtype":"float32","sparse":false,"name":"input31"},"inbound_nodes":[]},{"name":"input32","class_name":"InputLayer","config":{"batch_input_shape":[null,133],"dtype":"float32","sparse":false,"name":"input32"},"inbound_nodes":[]},{"name":"input33","class_name":"InputLayer","config":{"batch_input_shape":[null,151],"dtype":"float32","sparse":false,"name":"input33"},"inbound_nodes":[]},{"name":"input34","class_name":"InputLayer","config":{"batch_input_shape":[null,130],"dtype":"float32","sparse":false,"name":"input34"},"inbound_nodes":[]},{"name":"input35","class_name":"InputLayer","config":{"batch_input_shape":[null,95],"dtype":"float32","sparse":false,"name":"input35"},"inbound_nodes":[]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["input29",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["input30",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["input31",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["input32",0,0,{}]]]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["input33",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["input34",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["input35",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense10",0,0,{}],["dense_Dense11",0,0,{}],["dense_Dense12",0,0,{}],["dense_Dense13",0,0,{}],["dense_Dense14",0,0,{}],["dense_Dense1",0,0,{}],["dense_Dense5",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input29",0,0],["input30",0,0],["input31",0,0],["input32",0,0],["input33",0,0],["input34",0,0],["input35",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense10/kernel","shape":[167,1000],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[185,1000],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[185,1000],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[133,1000],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[151,1000],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[130,1000],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[95,1000],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[7000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}