{"modelTopology":{"class_name":"Model","config":{"name":"model7","layers":[{"name":"input26","class_name":"InputLayer","config":{"batch_input_shape":[null,260],"dtype":"float32","sparse":false,"name":"input26"},"inbound_nodes":[]},{"name":"input27","class_name":"InputLayer","config":{"batch_input_shape":[null,251],"dtype":"float32","sparse":false,"name":"input27"},"inbound_nodes":[]},{"name":"input28","class_name":"InputLayer","config":{"batch_input_shape":[null,230],"dtype":"float32","sparse":false,"name":"input28"},"inbound_nodes":[]},{"name":"input29","class_name":"InputLayer","config":{"batch_input_shape":[null,186],"dtype":"float32","sparse":false,"name":"input29"},"inbound_nodes":[]},{"name":"input30","class_name":"InputLayer","config":{"batch_input_shape":[null,204],"dtype":"float32","sparse":false,"name":"input30"},"inbound_nodes":[]},{"name":"dense_Dense26","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true},"inbound_nodes":[[["input26",0,0,{}]]]},{"name":"dense_Dense27","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true},"inbound_nodes":[[["input27",0,0,{}]]]},{"name":"dense_Dense28","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true},"inbound_nodes":[[["input28",0,0,{}]]]},{"name":"dense_Dense29","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true},"inbound_nodes":[[["input29",0,0,{}]]]},{"name":"dense_Dense6","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true},"inbound_nodes":[[["input30",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense26",0,0,{}],["dense_Dense27",0,0,{}],["dense_Dense28",0,0,{}],["dense_Dense29",0,0,{}],["dense_Dense6",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input26",0,0],["input27",0,0],["input28",0,0],["input29",0,0],["input30",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense26/kernel","shape":[260,1000],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[251,1000],"dtype":"float32"},{"name":"dense_Dense27/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense28/kernel","shape":[230,1000],"dtype":"float32"},{"name":"dense_Dense28/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense29/kernel","shape":[186,1000],"dtype":"float32"},{"name":"dense_Dense29/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense6/kernel","shape":[204,1000],"dtype":"float32"},{"name":"dense_Dense6/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[5000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}