{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input8","class_name":"InputLayer","config":{"batch_input_shape":[null,215],"dtype":"float32","sparse":false,"name":"input8"},"inbound_nodes":[]},{"name":"input9","class_name":"InputLayer","config":{"batch_input_shape":[null,258],"dtype":"float32","sparse":false,"name":"input9"},"inbound_nodes":[]},{"name":"input10","class_name":"InputLayer","config":{"batch_input_shape":[null,247],"dtype":"float32","sparse":false,"name":"input10"},"inbound_nodes":[]},{"name":"input11","class_name":"InputLayer","config":{"batch_input_shape":[null,153],"dtype":"float32","sparse":false,"name":"input11"},"inbound_nodes":[]},{"name":"input12","class_name":"InputLayer","config":{"batch_input_shape":[null,199],"dtype":"float32","sparse":false,"name":"input12"},"inbound_nodes":[]},{"name":"input13","class_name":"InputLayer","config":{"batch_input_shape":[null,203],"dtype":"float32","sparse":false,"name":"input13"},"inbound_nodes":[]},{"name":"input14","class_name":"InputLayer","config":{"batch_input_shape":[null,95],"dtype":"float32","sparse":false,"name":"input14"},"inbound_nodes":[]},{"name":"dense_Dense10","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true},"inbound_nodes":[[["input8",0,0,{}]]]},{"name":"dense_Dense11","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense11","trainable":true},"inbound_nodes":[[["input9",0,0,{}]]]},{"name":"dense_Dense12","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense12","trainable":true},"inbound_nodes":[[["input10",0,0,{}]]]},{"name":"dense_Dense13","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense13","trainable":true},"inbound_nodes":[[["input11",0,0,{}]]]},{"name":"dense_Dense14","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense14","trainable":true},"inbound_nodes":[[["input12",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["input13",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["input14",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense10",0,0,{}],["dense_Dense11",0,0,{}],["dense_Dense12",0,0,{}],["dense_Dense13",0,0,{}],["dense_Dense14",0,0,{}],["dense_Dense1",0,0,{}],["dense_Dense5",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input8",0,0],["input9",0,0],["input10",0,0],["input11",0,0],["input12",0,0],["input13",0,0],["input14",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense10/kernel","shape":[215,1000],"dtype":"float32"},{"name":"dense_Dense10/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense11/kernel","shape":[258,1000],"dtype":"float32"},{"name":"dense_Dense11/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense12/kernel","shape":[247,1000],"dtype":"float32"},{"name":"dense_Dense12/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense13/kernel","shape":[153,1000],"dtype":"float32"},{"name":"dense_Dense13/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense14/kernel","shape":[199,1000],"dtype":"float32"},{"name":"dense_Dense14/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[203,1000],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[95,1000],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[7000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}