{"modelTopology":{"class_name":"Model","config":{"name":"model3","layers":[{"name":"input5","class_name":"InputLayer","config":{"batch_input_shape":[null,233],"dtype":"float32","sparse":false,"name":"input5"},"inbound_nodes":[]},{"name":"input6","class_name":"InputLayer","config":{"batch_input_shape":[null,251],"dtype":"float32","sparse":false,"name":"input6"},"inbound_nodes":[]},{"name":"input7","class_name":"InputLayer","config":{"batch_input_shape":[null,230],"dtype":"float32","sparse":false,"name":"input7"},"inbound_nodes":[]},{"name":"input8","class_name":"InputLayer","config":{"batch_input_shape":[null,175],"dtype":"float32","sparse":false,"name":"input8"},"inbound_nodes":[]},{"name":"dense_Dense26","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true},"inbound_nodes":[[["input5",0,0,{}]]]},{"name":"dense_Dense27","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true},"inbound_nodes":[[["input6",0,0,{}]]]},{"name":"dense_Dense28","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true},"inbound_nodes":[[["input7",0,0,{}]]]},{"name":"dense_Dense29","class_name":"Dense","config":{"units":1000,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true},"inbound_nodes":[[["input8",0,0,{}]]]},{"name":"myConcatenate1","class_name":"Concatenate","config":{"axis":1,"name":"myConcatenate1","trainable":true},"inbound_nodes":[[["dense_Dense26",0,0,{}],["dense_Dense27",0,0,{}],["dense_Dense28",0,0,{}],["dense_Dense29",0,0,{}]]]},{"name":"myConcatenate1Dense4","class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"myConcatenate1Dense4","trainable":true},"inbound_nodes":[[["myConcatenate1",0,0,{}]]]}],"input_layers":[["input5",0,0],["input6",0,0],["input7",0,0],["input8",0,0]],"output_layers":[["myConcatenate1Dense4",0,0]]},"keras_version":"tfjs-layers 0.8.2","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"dense_Dense26/kernel","shape":[233,1000],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[251,1000],"dtype":"float32"},{"name":"dense_Dense27/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense28/kernel","shape":[230,1000],"dtype":"float32"},{"name":"dense_Dense28/bias","shape":[1000],"dtype":"float32"},{"name":"dense_Dense29/kernel","shape":[175,1000],"dtype":"float32"},{"name":"dense_Dense29/bias","shape":[1000],"dtype":"float32"},{"name":"myConcatenate1Dense4/kernel","shape":[4000,1],"dtype":"float32"},{"name":"myConcatenate1Dense4/bias","shape":[1],"dtype":"float32"}]}]}